# coding: utf-8

import speech_recognition as sr
from pykakasi import kakasi
import jaconv
import serial, time
#import re

ser = serial.Serial("COM4", 9600)

r = sr.Recognizer()
mic = sr.Microphone()
kakasi = kakasi()

dict_2_1 = {"あ":1, "い":4, "う":1, "え":4, "お":2,
            "か":1, "き":4, "く":1, "け":4, "こ":2,
            "さ":1, "し":4, "す":1, "せ":4, "そ":2,
            "た":5, "ち":7, "つ":5, "て":7, "と":6,
            "な":5, "に":7, "ぬ":5, "ね":7, "の":6,
            "は":5, "ひ":7, "ふ":5, "へ":7, "ほ":6,
            "ま":5, "み":7, "む":5, "め":7, "も":6,
            "や":3,         "ゆ":3,         "よ":3,
            "ら":1, "り":4, "る":1, "れ":4, "ろ":2,
            "わ":3,         "を":3,         "ん":3,
            "っ":2, "ー":2}

dict_2_2 = {"あ":0, "い":0, "う":1, "え":1, "お":1,
            "か":3, "き":3, "く":5, "け":5, "こ":5,
            "さ":6, "し":6, "す":7, "せ":7, "そ":7,
            "た":2, "ち":2, "つ":4, "て":4, "と":4,
            "な":0, "に":0, "ぬ":1, "ね":1, "の":1,
            "は":3, "ひ":3, "ふ":5, "へ":5, "ほ":5,
            "ま":6, "み":6, "む":7, "め":7, "も":7,
            "や":1,         "ゆ":5,         "よ":4,
            "ら":2, "り":2, "る":4, "れ":4, "ろ":4,
            "わ":0,         "を":2,         "ん":6,
            "っ":0, "ー":2}

dict_4_1 = {"が":0, "ぎ":0, "ぐ":0, "げ":0, "ご":0,
            "ざ":0, "じ":0, "ず":0, "ぜ":0, "ぞ":0,
            "だ":0, "ぢ":0, "づ":0, "で":0, "ど":0,
            "ば":0, "び":0, "ぶ":0, "べ":0, "ぼ":0,
            "ぱ":0, "ぴ":0, "ぷ":0, "ぺ":0, "ぽ":0,
            "きゃ":0, "きゅ":0, "きょ":0,
            "ぎゃ":0, "ぎゅ":0, "ぎょ":0,
            "しゃ":0, "しゅ":0, "しょ":0,
            "じゃ":0, "じゅ":0, "じょ":0,
            "ちゃ":0, "ちゅ":0, "ちょ":0,
            "にゃ":0, "にゅ":0, "にょ":0,
            "ひゃ":0, "ひゅ":0, "ひょ":0,
            "びゃ":0, "びゅ":0, "びょ":0,
            "ぴゃ":0, "ぴゅ":0, "ぴょ":0,
            "みゃ":0, "みゅ":0, "みょ":0,
            "りゃ":0, "りゅ":0, "りょ":0,
            "いぇ":0, "しぇ":0, "じぇ":0, "ちぇ":0,
            "うぃ":2, "うぇ":2, "うぉ":2,
            "くぁ":2, "くぃ":2, "くぇ":2, "くぉ":2,
            "ぐぁ":2,
            "つぁ":2, "つぃ":2, "つぇ":2, "つぉ":2,
            "ふぁ":2, "ふぃ":2, "ふぇ":2, "ふぉ":2,
            "ヴぁ":2, "ヴぃ":2, "ヴぇ":2, "ヴぉ":2,
            "てぃ":0, "でぃ":0, "とぅ":2, "どぅ":2,
            "てゅ":0, "でゅ":0, "ふゅ":0, "ヴゅ":0,
            "ヴ":0,
            "1":3, "2":3, "3":3, "4":3, "5":3,
            "6":3, "7":3, "8":3, "9":3, "0":3}

dict_4_2 = {"が":2, "ぎ":2, "ぐ":2, "げ":2, "ご":2,
            "ざ":2, "じ":2, "ず":2, "ぜ":2, "ぞ":2,
            "だ":2, "ぢ":2, "づ":2, "で":2, "ど":2,
            "ば":2, "び":2, "ぶ":2, "べ":2, "ぼ":2,
            "ぱ":3, "ぴ":3, "ぷ":3, "ぺ":3, "ぽ":3,
            "きゃ":1, "きゅ":1, "きょ":1,
            "ぎゃ":4, "ぎゅ":4, "ぎょ":4,
            "しゃ":1, "しゅ":1, "しょ":1,
            "じゃ":4, "じゅ":4, "じょ":4,
            "ちゃ":1, "ちゅ":1, "ちょ":1,
            "にゃ":1, "にゅ":1, "にょ":1,
            "ひゃ":1, "ひゅ":1, "ひょ":1,
            "びゃ":4, "びゅ":4, "びょ":4,
            "ぴゃ":5, "ぴゅ":5, "ぴょ":5,
            "みゃ":1, "みゅ":1, "みょ":1,
            "りゃ":1, "りゅ":1, "りょ":1,
            "いぇ":1, "しぇ":1, "じぇ":4, "ちぇ":1,
            "うぃ":3, "うぇ":3, "うぉ":3,
            "くぁ":3, "くぃ":3, "くぇ":3, "くぉ":3,
            "ぐぁ":6,
            "つぁ":3, "つぃ":3, "つぇ":3, "つぉ":3,
            "ふぁ":3, "ふぃ":3, "ふぇ":3, "ふぉ":3,
            "ヴぁ":6, "ヴぃ":6, "ヴぇ":6, "ヴぉ":6,
            "てぃ":1, "でぃ":4, "とぅ":3, "どぅ":6,
            "てゅ":5, "でゅ":7, "ふゅ":5, "ヴゅ":7,
            "ヴ":2,
            "1":7, "2":7, "3":7, "4":7, "5":7,
            "6":7, "7":7, "8":7, "9":7, "0":7}

dict_4_3 = {"が":1, "ぎ":4, "ぐ":1, "げ":4, "ご":2,
            "ざ":1, "じ":4, "ず":1, "ぜ":4, "ぞ":2,
            "だ":5, "ぢ":7, "づ":5, "で":7, "ど":6,
            "ば":5, "び":7, "ぶ":5, "べ":7, "ぼ":6,
            "ぱ":5, "ぴ":7, "ぷ":5, "ぺ":7, "ぽ":6,
            "きゃ":1, "きゅ":1, "きょ":2,
            "ぎゃ":1, "ぎゅ":1, "ぎょ":2,
            "しゃ":1, "しゅ":1, "しょ":2,
            "じゃ":1, "じゅ":1, "じょ":2,
            "ちゃ":5, "ちゅ":5, "ちょ":6,
            "にゃ":5, "にゅ":5, "にょ":6,
            "ひゃ":5, "ひゅ":5, "ひょ":6,
            "びゃ":5, "びゅ":5, "びょ":6,
            "ぴゃ":5, "ぴゅ":5, "ぴょ":6,
            "みゃ":5, "みゅ":5, "みょ":6,
            "りゃ":1, "りゅ":1, "りょ":2,
            "いぇ":4, "しぇ":4, "じぇ":4, "ちぇ":7,
            "うぃ":4, "うぇ":4, "うぉ":2,
            "くぁ":1, "くぃ":4, "くぇ":4, "くぉ":2,
            "ぐぁ":1,
            "つぁ":5, "つぃ":7, "つぇ":7, "つぉ":6,
            "ふぁ":5, "ふぃ":7, "ふぇ":7, "ふぉ":6,
            "ヴぁ":5, "ヴぃ":7, "ヴぇ":7, "ヴぉ":6,
            "てぃ":7, "でぃ":7, "とぅ":5, "どぅ":5,
            "てゅ":5, "でゅ":5, "ふゅ":3, "ヴゅ":3,
            "ヴ":1,
            "1":1, "2":4, "3":1, "4":1, "5":1,
            "6":4, "7":4, "8":4, "9":2, "0":2}

dict_4_4 = {"が":3, "ぎ":3, "ぐ":5, "げ":5, "ご":5,
            "ざ":6, "じ":6, "ず":7, "ぜ":7, "ぞ":7,
            "だ":2, "ぢ":2, "づ":4, "で":4, "ど":4,
            "ば":3, "び":3, "ぶ":5, "べ":5, "ぼ":5,
            "ぱ":3, "ぴ":3, "ぷ":5, "ぺ":5, "ぽ":5,
            "きゃ":3, "きゅ":5, "きょ":5,
            "ぎゃ":3, "ぎゅ":5, "ぎょ":5,
            "しゃ":6, "しゅ":7, "しょ":7,
            "じゃ":6, "じゅ":7, "じょ":7,
            "ちゃ":2, "ちゅ":4, "ちょ":4,
            "にゃ":0, "にゅ":1, "にょ":1,
            "ひゃ":3, "ひゅ":5, "ひょ":5,
            "びゃ":3, "びゅ":5, "びょ":5,
            "ぴゃ":3, "ぴゅ":5, "ぴょ":5,
            "みゃ":6, "みゅ":7, "みょ":7,
            "りゃ":2, "りゅ":4, "りょ":4,
            "いぇ":1, "しぇ":7, "じぇ":7, "ちぇ":4,
            "うぃ":0, "うぇ":1, "うぉ":1,
            "くぁ":3, "くぃ":3, "くぇ":5, "くぉ":5,
            "ぐぁ":3,
            "つぁ":2, "つぃ":2, "つぇ":4, "つぉ":4,
            "ふぁ":3, "ふぃ":3, "ふぇ":5, "ふぉ":5,
            "ヴぁ":3, "ヴぃ":3, "ヴぇ":5, "ヴぉ":5,
            "てぃ":2, "でぃ":2, "とぅ":4, "どぅ":4,
            "てゅ":4, "でゅ":4, "ふゅ":5, "ヴゅ":5,
            "ヴ":1,
            "1":0, "2":0, "3":1, "4":4, "5":2,
            "6":1, "7":4, "8":2, "9":1, "0":4}

dot_4_list = ["が", "ぎ", "ぐ", "げ", "ご",
              "ざ", "じ", "ず", "ぜ", "ぞ",
              "だ", "ぢ", "づ", "で", "ど",
              "ば", "び", "ぶ", "べ", "ぼ",
              "ぱ", "ぴ", "ぷ", "ぺ", "ぽ",
              "きゃ", "きゅ", "きょ",
              "ぎゃ", "ぎゅ", "ぎょ",
              "しゃ", "しゅ", "しょ",
              "じゃ", "じゅ", "じょ",
              "ちゃ", "ちゅ", "ちょ",
              "にゃ", "にゅ", "にょ",
              "ひゃ", "ひゅ", "ひょ",
              "びゃ", "びゅ", "びょ",
              "ぴゃ", "ぴゅ", "ぴょ",
              "みゃ", "みゅ", "みょ",
              "りゃ", "りゅ", "りょ",
              "いぇ", "しぇ", "じぇ", "ちぇ",
              "うぃ", "うぇ", "うぉ",
              "くぁ", "くぃ", "くぇ", "くぉ",
              "ぐぁ",
              "つぁ", "つぃ", "つぇ", "つぉ",
              "ふぁ", "ふぃ", "ふぇ", "ふぉ",
              "ヴぁ", "ヴぃ", "ヴぇ", "ヴぉ",
              "てぃ", "でぃ", "とぅ", "どぅ",
              "てゅ", "でゅ", "ふゅ", "ヴゅ",
              "ヴ",
              "1", "2", "3", "4", "5",
              "6", "7", "8", "9", "0"]

small_char_list = ["ぁ", "ぃ", "ぅ", "ぇ", "ぉ", "ゃ", "ゅ", "ょ"]

def kana_to_signal_2(cha):

    print(cha)

    if (dict_2_1[cha] == 0):
        ser.write(b"0")
    elif (dict_2_1[cha] == 1):
        ser.write(b"1")
    elif (dict_2_1[cha] == 2):
        ser.write(b"2")
    elif (dict_2_1[cha] == 3):
        ser.write(b"3")
    elif (dict_2_1[cha] == 4):
        ser.write(b"4")
    elif (dict_2_1[cha] == 5):
        ser.write(b"5")
    elif (dict_2_1[cha] == 6):
        ser.write(b"6")
    elif (dict_2_1[cha] == 7):
        ser.write(b"7")
    else:
        print("error in dict_2_1")
    time.sleep(0.5)

    if (dict_2_2[cha] == 0):
        ser.write(b"0")
    elif (dict_2_2[cha] == 1):
        ser.write(b"1")
    elif (dict_2_2[cha] == 2):
        ser.write(b"2")
    elif (dict_2_2[cha] == 3):
        ser.write(b"3")
    elif (dict_2_2[cha] == 4):
        ser.write(b"4")
    elif (dict_2_2[cha] == 5):
        ser.write(b"5")
    elif (dict_2_2[cha] == 6):
        ser.write(b"6")
    elif (dict_2_2[cha] == 7):
        ser.write(b"7")
    else:
        print("error in dict_2_2")
    time.sleep(0.5)

def kana_to_signal_4(cha):

    print(cha)

    if (dict_4_1[cha] == 0):
        ser.write(b"0")
    elif (dict_4_1[cha] == 1):
        ser.write(b"1")
    elif (dict_4_1[cha] == 2):
        ser.write(b"2")
    elif (dict_4_1[cha] == 3):
        ser.write(b"3")
    elif (dict_4_1[cha] == 4):
        ser.write(b"4")
    elif (dict_4_1[cha] == 5):
        ser.write(b"5")
    elif (dict_4_1[cha] == 6):
        ser.write(b"6")
    elif (dict_4_1[cha] == 7):
        ser.write(b"7")
    else:
        print("error in dict_4_1")
    time.sleep(0.5)

    if (dict_4_2[cha] == 0):
        ser.write(b"0")
    elif (dict_4_2[cha] == 1):
        ser.write(b"1")
    elif (dict_4_2[cha] == 2):
        ser.write(b"2")
    elif (dict_4_2[cha] == 3):
        ser.write(b"3")
    elif (dict_4_2[cha] == 4):
        ser.write(b"4")
    elif (dict_4_2[cha] == 5):
        ser.write(b"5")
    elif (dict_4_2[cha] == 6):
        ser.write(b"6")
    elif (dict_4_2[cha] == 7):
        ser.write(b"7")
    else:
        print("error in dict_4_2")
    time.sleep(0.5)

    if (dict_4_3[cha] == 0):
        ser.write(b"0")
    elif (dict_4_3[cha] == 1):
        ser.write(b"1")
    elif (dict_4_3[cha] == 2):
        ser.write(b"2")
    elif (dict_4_3[cha] == 3):
        ser.write(b"3")
    elif (dict_4_3[cha] == 4):
        ser.write(b"4")
    elif (dict_4_3[cha] == 5):
        ser.write(b"5")
    elif (dict_4_3[cha] == 6):
        ser.write(b"6")
    elif (dict_4_3[cha] == 7):
        ser.write(b"7")
    else:
        print("error in dict_4_3")
    time.sleep(0.5)

    if (dict_4_4[cha] == 0):
        ser.write(b"0")
    elif (dict_4_4[cha] == 1):
        ser.write(b"1")
    elif (dict_4_4[cha] == 2):
        ser.write(b"2")
    elif (dict_4_4[cha] == 3):
        ser.write(b"3")
    elif (dict_4_4[cha] == 4):
        ser.write(b"4")
    elif (dict_4_4[cha] == 5):
        ser.write(b"5")
    elif (dict_4_4[cha] == 6):
        ser.write(b"6")
    elif (dict_4_4[cha] == 7):
        ser.write(b"7")
    else:
        print("error in dict_4_4")
    time.sleep(0.5)

while True:

    print("Say something ...")

    with mic as source:
        r.adjust_for_ambient_noise(source) #雑音対策
        audio = r.listen(source)

    print ("Now to recognize it...")

    try:
        # "ストップ" と言ったら音声認識を止める
        if r.recognize_google(audio, language='ja-JP') == "ストップ" :
            print("ストップ -> finish!")
            break

        text = r.recognize_google(audio, language='ja-JP')
        kakasi.setMode('J', 'H')
        conv = kakasi.getConverter()
        print(text)
        #print(" ")
        kana_text = jaconv.kata2hira(conv.do(text))
        char_list = list(kana_text)
        for i in range(len(char_list)):
            #小文字だった時はスキップ
            if (char_list[i] in small_char_list):
                continue
            #文字が空白だった場合
            if (char_list[i] == " "):
                print(" ")
                ser.write(b"0")
                time.sleep(0.5)
                ser.write(b"0")
                time.sleep(0.5)
                continue
            if (i != (len(char_list) - 1)):
                #次の文字が小文字だった時は一体化
                if (char_list[i + 1] in small_char_list):
                    kana = char_list[i] + char_list[i + 1]
                else:
                    kana = char_list[i]
            else:
                kana = char_list[i]
            #点列が2列と4列で振り分け
            if ((len(kana) > 1) or (kana in dot_4_list)):
                kana_to_signal_4(kana)
            else:
                kana_to_signal_2(kana)
            #c = ser.readline()
            #d = re.findall('[0-9]+\.+[0-9]',str(c),flags=0)
            #d = [float(i) for i in d]
            #for i in range(0, len(d)): 
            #    print(d[i])

    # 以下は認識できなかったときに止まらないように。
    except sr.UnknownValueError:
        print("could not understand audio")
    except sr.RequestError as e:
        print("Could not request results from Google Speech Recognition service; {0}".format(e))

ser.close()